2020-08-06_12-03-20.394180/pre1.yml
execution:
  - executor: jmeter
    concurrency: 100   # number of virtual users
    ramp-up: 10s
  #  steps: 5          # number of steps of growing
    scenario: apiCall
    run-items:
      - loadtests.ClientAPITest#pre1


scenarios:
  apiCall:
    script: ./src/test/java/loadtests
    additional-classpath:
      - target/*


services:
  - module: shellexec
    prepare: mvn -Dmaven.test.skip=true  clean package

reporting:
  - module: junit-xml